export const api_cars = {

  // ========================================================

  // Компоненты для загрузки

  components: {
    'Header': true,
    'Body': true,
    'Footer': false},

  // ========================================================
  
  // CallBack при нажатии на элемент списка - 
  // в аргумент передатется объект со всеми полями
  
  callback: function(arg) {
                  return console.log(arg)},

  // ========================================================

  // наименования полей, которые необходимо вывести в список
  // по умолчанию сортировка идет по полю lastName

  columns: {
          make:'Марка',
          color:'цвет',
          race: 'пробег'},         

  // ========================================================

  // отоборажение данных 
  // для табличной формы установить true / для строчной - false
  
  table: true,
        }

