export const api_phoneBook = {

  // ========================================================

  // Компоненты для загрузки

  components: {
    'Header': false,
    'Body': true,
    'Footer': false},

  // ========================================================
  
  // CallBack при нажатии на элемент списка - 
  // в аргумент передатется объект со всеми полями
  
  callback: function(arg) {
                  return console.log(arg)},

  // ========================================================

  // наименования полей, которые необходимо вывести в список
  // по умолчанию сортировка идет по полю lastName

  columns: {
          name:'имя',
          lastName:'фамилия'},         

  // ========================================================

  // отоборажение данных 
  // для табличной формы установить true / для строчной - false
  
  table: false,

}
